NUMBERS_WITH_WORDS = [
    {'number': '100', 'words': 'сто'},
    {'number': '109', 'words': 'сто девять'},
    {'number': '800', 'words': 'восемьсот'},
    {'number': '1111', 'words': 'одна тысяча сто одинадцать'},
    {'number': '3125', 'words': 'три тысячи сто двадцать пять'},
    {'number': '8000', 'words': 'восемь тысячь'},
    {'number': '100000', 'words': 'сто тысячь'},
    {
        'number': '987654',
        'words': 'девятьсот восемьдесят семь тысячь шестьсот пятьдесят четыре'
    },
    {'number': '1000000', 'words': 'один миллион'},
    {
        'number': '125000521',
        'words': 'сто двадцать пять миллионов пятьсот двадцать один'
    },
    {
        'number': '320888000',
        'words': (
            'триста двадцать миллионов восемьсот восемьдесят восемь тысячь'
        )
    },
]
