SINGLE_DIGITS = {
    1: 'один',
    2: 'два',
    3: 'три',
    4: 'четыре',
    5: 'пять',
    6: 'шесть',
    7: 'семь',
    8: 'восемь',
    9: 'девять',
}
SINGLE_DIGITS_FEMININE = {
    1: 'одна',
    2: 'две',
    3: 'три',
    4: 'четыре',
    5: 'пять',
    6: 'шесть',
    7: 'семь',
    8: 'восемь',
    9: 'девять',
}

DOUBLE_DIGITS = {
    11: 'одинадцать',
    12: 'двенадцать',
    13: 'тринадцать',
    14: 'четырнадцать',
    15: 'пятнадцать',
    16: 'шестьнадцать',
    17: 'семьнадцать',
    18: 'восемьнадцать',
    19: 'девятнадцать',
}

DOUBLE_DIGITS_DECS = {
    10: 'десять',
    20: 'двадцать',
    30: 'тридцать',
    40: 'сорок',
    50: 'пятьдесят',
    60: 'шестьдесят',
    70: 'семьдесят',
    80: 'восемьдесят',
    90: 'девяносто',
}

TRIPLE_DIGITS = {
    100: 'сто',
    200: 'двести',
    300: 'триста',
    400: 'четыреста',
    500: 'пятьсот',
    600: 'шестьсот',
    700: 'семьсот',
    800: 'восемьсот',
    900: 'девятьсот',
}

THOUSAND_ENDINGS = {
    1: 'тысяча',
    2: 'тысячи',
    4: 'тысячи',
    3: 'тысячи',
    5: 'тысячь',
    6: 'тысячь',
    7: 'тысячь',
    8: 'тысячь',
    9: 'тысячь',
}

MILLION_ENDINGS = {
    1: 'миллион',
    2: 'миллиона',
    3: 'миллиона',
    4: 'миллиона',
    5: 'миллионов',
    6: 'миллионов',
    7: 'миллионов',
    8: 'миллионов',
    9: 'миллионов',
}
